Service - Income Tax/sample messages/ErrorCode2358.txt

Error code 2358

Request
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <add:Action xmlns:add="http://www.w3.org/2005/08/addressing">https://services.ird.govt.nz/GWS/Returns/Return/File</add:Action>
    </soap:Header>
    <soap:Body>
        <ret:File xmlns:ret="https://services.ird.govt.nz/GWS/Returns/">
            <ret:ReturnFileRequestMsg>
                <fil:FileRequestWrapper xmlns:fil="https://services.ird.govt.nz/GWS/Returns/:types/FileRequest">
                    <r3NR:fileRequest xmlns:r3NR="urn:www.ird.govt.nz/GWS:types/ReturnIR3NR.v1" xmlns:rc="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2">
                        <rc:fileHeader xmlns:cmn="urn:www.ird.govt.nz/GWS:types/Common.v2">
                            <cmn:softwareProviderData>
                                <cmn:softwareProvider>SoftwareProvider</cmn:softwareProvider>
                                <cmn:softwarePlatform>SoftwarePlatform</cmn:softwarePlatform>
                                <cmn:softwareRelease>1</cmn:softwareRelease>
                            </cmn:softwareProviderData>
                            <cmn:identifier IdentifierValueType="IRD">093989910</cmn:identifier>
                            <cmn:accountType>INC</cmn:accountType>
                            <rc:periodEndDate>2023-03-31</rc:periodEndDate>
                            <rc:majorFormType>INC</rc:majorFormType>
                            <rc:minorFormType>3NR</rc:minorFormType>
                        </rc:fileHeader>
                        <rc:fileBody>
                            <rc:standardFields>
                                <rc:isNilReturn>false</rc:isNilReturn>
                                <rc:isFinalReturn>false</rc:isFinalReturn>
                                <rc:amendmentRequest>
                                    <rc:isAmended>false</rc:isAmended>
                                    <rc:amendReason/>
                                    <rc:amendDetails/>
                                </rc:amendmentRequest>
                            </rc:standardFields>
                            <rc:formFields xsi:type="r3NR:FormFieldsType" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ic="urn:www.ird.govt.nz/GWS:types/IncomeReturnCommon.v1">
                                <r3NR:nzSuperIndicator>false</r3NR:nzSuperIndicator>
                                <r3NR:totalInterestRWT>0</r3NR:totalInterestRWT>
                                <r3NR:totalInterest>0</r3NR:totalInterest>
                                <r3NR:nrwtOnTotalInterest>0</r3NR:nrwtOnTotalInterest>
                                <r3NR:totalDividendCredits>0</r3NR:totalDividendCredits>
                                <r3NR:totalDividends>0</r3NR:totalDividends>
                                <r3NR:nrwtOnTotalDividends>0</r3NR:nrwtOnTotalDividends>
                                <r3NR:totalWithholdingTaxOnRoyalties>0</r3NR:totalWithholdingTaxOnRoyalties>
                                <r3NR:totalRoyalties>0</r3NR:totalRoyalties>
                                <r3NR:nrwtOnTotalRoyalties>0</r3NR:nrwtOnTotalRoyalties>
                                <r3NR:totalTaxCredits>10</r3NR:totalTaxCredits>
                                <r3NR:totalNRWT>0</r3NR:totalNRWT>
                                <r3NR:nzIncomeWithTaxDeducted>
                                    <ic:totalTaxPaid>0</ic:totalTaxPaid>
                                    <ic:totalIncome>0</ic:totalIncome>
                                </r3NR:nzIncomeWithTaxDeducted>
                                <r3NR:maoriAuthorityDistributions>
                                    <ic:totalMACredits>1000.00</ic:totalMACredits>
                                    <ic:totalMADistributions>1000.00</ic:totalMADistributions>
                                </r3NR:maoriAuthorityDistributions>
                                <r3NR:pieIncome>
                                    <ic:totalTaxCredits>0</ic:totalTaxCredits>
                                    <ic:totalIncome>1000.00</ic:totalIncome>
                                </r3NR:pieIncome>
                                <r3NR:partnershipIncome>
                                    <ic:totalTaxCredits>1000.00</ic:totalTaxCredits>
                                    <ic:totalIncome>1000.00</ic:totalIncome>
                                </r3NR:partnershipIncome>
                                <r3NR:estateTrustIncome>
                                    <ic:totalTaxCredits>1000.00</ic:totalTaxCredits>
                                    <ic:totalIncome>1000.00</ic:totalIncome>
                                </r3NR:estateTrustIncome>
                                <r3NR:ltcIncome>
                                    <ic:totalTaxCredits>1000.00</ic:totalTaxCredits>
                                    <ic:totalIncome>1000.00</ic:totalIncome>
                                </r3NR:ltcIncome>
                                <r3NR:ltcNonAllowableDeductions>0</r3NR:ltcNonAllowableDeductions>
                                <r3NR:ltcPriorYearNonAllowableDeductionsClaimed>0</r3NR:ltcPriorYearNonAllowableDeductionsClaimed>
                                <r3NR:ltcAdjustedIncome>1000.00</r3NR:ltcAdjustedIncome>
                                <r3NR:governmentSubsidies>0.00</r3NR:governmentSubsidies>
                                <r3NR:otherCredits>4000.00</r3NR:otherCredits>
                                <r3NR:residentialRentalIncome>
                                    <ic:indicator>I</ic:indicator>
                                    <ic:grossResRentalIncome>600.00</ic:grossResRentalIncome>
                                    <ic:netBrightlineProfits>750.00</ic:netBrightlineProfits>
                                    <ic:otherResIncome>750.00</ic:otherResIncome>
                                    <ic:totalIncome>2100.00</ic:totalIncome>
                                    <ic:residentialRentalDeductions>1000.00</ic:residentialRentalDeductions>
                                    <ic:excessDeductionsBroughtForward>0.00</ic:excessDeductionsBroughtForward>
                                    <ic:deductionsClaimedThisYear>1000.00</ic:deductionsClaimedThisYear>
                                    <ic:netIncome>1100.00</ic:netIncome>
                                    <ic:excessDeductionsCarriedForward>0.00</ic:excessDeductionsCarriedForward>
                                </r3NR:residentialRentalIncome>
                                <r3NR:propertyInterestLimitation>
                                    <ic:totalInterest>0</ic:totalInterest>
                                    <ic:interestExpenseClaimed>0.00</ic:interestExpenseClaimed>
                                    <ic:interestExpenseClaimedReason>
                                        <ic:notResidentialOrMaoriExempt>false</ic:notResidentialOrMaoriExempt>
                                        <ic:propertyNotInNz>false</ic:propertyNotInNz>
                                        <ic:loansDrawnDown>false</ic:loansDrawnDown>
                                        <ic:newBuildExemption>false</ic:newBuildExemption>
                                        <ic:developmentExemption>false</ic:developmentExemption>
                                        <ic:emergencyTransitionalSocialCouncil>false</ic:emergencyTransitionalSocialCouncil>
                                        <ic:buildToRentExclusion>false</ic:buildToRentExclusion>
                                    </ic:interestExpenseClaimedReason>
                                </r3NR:propertyInterestLimitation>
                                <r3NR:netRentalIncome>1000.00</r3NR:netRentalIncome>
                                <r3NR:selfEmployedIncome>1000</r3NR:selfEmployedIncome>
                                <r3NR:otherIncome>1000.00</r3NR:otherIncome>
                                <r3NR:saleOfProperty>0</r3NR:saleOfProperty>
                                <r3NR:rlwtCredit>0</r3NR:rlwtCredit>
                                <r3NR:otherExpenses>1000.00</r3NR:otherExpenses>
                                <r3NR:lossesBroughtForward>0</r3NR:lossesBroughtForward>
                                <r3NR:lossesClaimedThisYear>0</r3NR:lossesClaimedThisYear>
                                <r3NR:lossCarriedBackPriorYear>0.00</r3NR:lossCarriedBackPriorYear>
                                <r3NR:totalTaxableIncome>8100.00</r3NR:totalTaxableIncome>
                                <r3NR:workedInNZ>true</r3NR:workedInNZ>
                                <r3NR:incomeEarned>1000.00</r3NR:incomeEarned>
                                <r3NR:weeksWorked>3</r3NR:weeksWorked>
                                <r3NR:daysWorked>21</r3NR:daysWorked>
                                <r3NR:arrivalDate>2018-05-01</r3NR:arrivalDate>
                                <r3NR:departureDate>2018-05-21</r3NR:departureDate>
                                <r3NR:imputationBroughtForward>0.00</r3NR:imputationBroughtForward>
                                <r3NR:taxOnTaxableIncome>850.50</r3NR:taxOnTaxableIncome>
                                <r3NR:researchAndDevelopment>
                                    <ic:creditBroughtForward>0.00</ic:creditBroughtForward>
                                    <ic:nonrefundableCredit>0.00</ic:nonrefundableCredit>
                                    <ic:refundableCredit>0.00</ic:refundableCredit>
                                </r3NR:researchAndDevelopment>
                                <r3NR:residualIncomeTax>-3149.50</r3NR:residualIncomeTax>
                                <r3NR:earlyPaymentDiscountEligibility>false</r3NR:earlyPaymentDiscountEligibility>
                                <r3NR:overpaymentProvisionalTax>0.00</r3NR:overpaymentProvisionalTax>
                                <r3NR:provisionalTax>
                                    <ic:provisionalTaxOption>STD</ic:provisionalTaxOption>
                                    <ic:provisionalTaxPayable>1000</ic:provisionalTaxPayable>
                                    <ic:provisionalTaxStartDate>2019-01-01</ic:provisionalTaxStartDate>
                                </r3NR:provisionalTax>
                                <r3NR:partYearReturnIndicator>false</r3NR:partYearReturnIndicator>
                                <r3NR:dateLeftNZ>2019-12-01</r3NR:dateLeftNZ>
                                <r3NR:timePlannedToBeAway>string</r3NR:timePlannedToBeAway>
                                <r3NR:taxIdNumber>111111111</r3NR:taxIdNumber>
                                <r3NR:noJurisdictionTin>true</r3NR:noJurisdictionTin>
                                <r3NR:tinNotRequired>true</r3NR:tinNotRequired>
                            </rc:formFields>
                        </rc:fileBody>
                    </r3NR:fileRequest>
                </fil:FileRequestWrapper>
            </ret:ReturnFileRequestMsg>
        </ret:File>
    </soap:Body>
</soap:Envelope>

Response
<env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope">
    <env:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
        <wsa:Action env:mustUnderstand="1">https://services.ird.govt.nz/GWS/Returns/Return/FileResponse</wsa:Action>
    </env:Header>
    <env:Body>
        <FileResponse xmlns="https://services.ird.govt.nz/GWS/Returns/">
            <FileResult>
                <b:FileResponseWrapper xmlns:b="https://services.ird.govt.nz/GWS/Returns/:types/FileResponse">
                    <fileResponse xmlns="urn:www.ird.govt.nz/GWS:types/ReturnCommon.v2">
                        <statusMessage xmlns="urn:www.ird.govt.nz/GWS:types/Common.v2">
                            <statusCode>2358</statusCode>
                            <errorMessage>no value provided for taxJurisdiction</errorMessage>
                        </statusMessage>
                    </fileResponse>
                </b:FileResponseWrapper>
            </FileResult>
        </FileResponse>
    </env:Body>
</env:Envelope>